InformationRegisters/LM_ЦеныТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>LM_ЦеныТарифов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/LM_ЦеныТарифов/Ext/ManagerModule.bsl
Функция ПолучитьСуммуТарифаНаДату(Тариф, Дата) Экспорт
	
	С = новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныТарифовСрезПоследних.Сумма КАК Сумма,
		|	ЦеныТарифовСрезПоследних.КоличествоЧасов КАК КоличествоЧасов
		|ИЗ
		|	РегистрСведений.LM_ЦеныТарифов.СрезПоследних(&Период, Тариф = &Тариф) КАК ЦеныТарифовСрезПоследних";  	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Тариф", Тариф);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() = 1 Тогда
		С.Вставить("Сумма",РезультатЗапроса[0].Сумма);
		С.Вставить("КоличествоЧасов",РезультатЗапроса[0].КоличествоЧасов);
		Возврат С;
	Иначе
		Возврат 0;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции
